import pandas as pd
import numpy as np
from matplotlib import pyplot as plt


#1. Відкрити та зчитати файл з даними.
print('#1. Відкрити та зчитати файл з даними.')
df = pd.read_csv('vehicle_sales.csv')
print(df.head())

#2. Визначити та вивести кількість записів та кількість полів у кожному записі.
print('\n#2. Визначити та вивести кількість записів та кількість полів у кожному записі.')
print(df.shape)


#3. Вивести К+7 перших
#K =15
print('\n#3. Вивести К+7 перших. K=15')
print(df.head(23))


#3. Вивести 5К-3 останніх записів.
#K =15
print('\n#3. Вивести 5К-3 останніх записі, K=15')
print(df.tail(72))


#4. Визначити та вивести тип полів кожного запису
print('\n#4. Визначити та вивести тип полів кожного запису')
print(df.info())


#5. Привести поля, що відповідають обсягам продаж, до числового вигляду(показати, що це виконано).
print('\n#5. Привести поля, що відповідають обсягам продаж, до числового вигляду(показати, що це виконано).')
df['Total_Sales_New'] = df['Total Sales New'].apply(lambda x :x.replace('$','')).astype(int)
df['Total_Sales_Used'] = df['Total Sales Used'].apply(lambda x :x.replace('$','')).astype(int)
print(df.info())


#6. Ввести нові поля:
#a. Сумарний обсяг продаж автомобілів (нових та б/в) у кожний
#період;
#b. Сумарний дохід від продажу автомобілів (нових та б/в) у кожний
#період;
#c. Різницю в обсязі продаж нових та б/в автомобілів у кожній
#період.
print('\n#6. Ввести нові поля: ')
df['Total_used+new'] = df['New'] + df['Used'] #a
df['Total_sales_used+new'] = df['Total_Sales_New'] + df['Total_Sales_Used'] #b
df['Difference_used-new'] = df['Used'] - df['New'] #c
print(df[['Total_used+new','Total_sales_used+new','Difference_used-new']].head())


#7. Змінити порядок розташування полів таким чином: Рік, Місяць,
#Сумарний дохід, Дохід від продажу нових автомобілів, Дохід від
#продажу б/в автомобілів, Сумарний обсяг продаж, Обсяг продаж нових
#автомобілів, Обсяг продаж б/в автомобілів, Різниця між обсягами
#продаж нових та б/в автомобілів.
print('\n#7. Змінити порядок розташування полів первним чином')
df_new= df[['Year','Month','Total_sales_used+new','Total_Sales_New','Total_Sales_Used','Total_used+new','New','Used','Difference_used-new']]
print(df_new.head())


#8. Визначити та вивести:
print('\n#8. Визначити та вивести:')
#a. Рік та місяць, у які нових автомобілів було продано менше за б/в;
print('\n#a. Рік та місяць, у які нових автомобілів було продано менше за б/в;')
print(df_new.query('New<Used')[['Year','Month']])
#b. Рік та місяць, коли сумарний дохід був мінімальн
print('\n#b. Рік та місяць, коли сумарний дохід був мінімальни')
print(df_new[df_new['Total_sales_used+new']==df_new['Total_sales_used+new'].min()][['Year','Month']])
#c. Рік та місяць, коли було продано найбільше б/в авто
print('\n#c. Рік та місяць, коли було продано найбільше б/в авто')
print(df_new[df_new['Used']==df_new['Used'].max()][['Year','Month']])


#9. Визначити та вивести:
#a. Сумарний обсяг продажу транспортних засобів за кожен рік
print('\n#a. Сумарний обсяг продажу транспортних засобів за кожен рік')
print(df_new.groupby('Year').sum()['Total_used+new'])
#b. Середній дохід від продажу б/в транспортних засобів в місяці М,
#де М – це порядковий номер у списку підгрупи за абеткою.
#M=15 отже MARCH
print('\n#b. Середній дохід від продажу б/в транспортних засобів в місяці March,')
print(df_new.query('Month=="MAR"').mean()['Total_Sales_Used'])


#10. Побудувати стовпчикову діаграму обсягу продаж нових авто у
# році 20YY, де дві останні цифри року визначаються як 17 – порядковий номер
#у списку підгрупи за абеткою.
#YY = 15
print(' Побудувати стовпчикову діаграму обсягу продаж нових авто уроці 2015')
df_2015 = df.query('Year==2015')
df_2015
plt.style.use('bmh')
fig, ax = plt.subplots()
ax.bar(df_2015['Month'],df_2015['New'])
ax.set_ylabel('Counts')
ax.set_title('#10.Oбсягу продаж нових авто у році 2015')

#11. Побудувати кругову діаграму сумарного обсягу продаж за кожен
#рік.
print('#11. Побудувати кругову діаграму сумарного обсягу продаж за кожен рік.')
df_pie = df[['Year','Total_sales_used+new']].groupby('Year').sum()
fig1, ax1 = plt.subplots()
colors = plt.get_cmap('Blues')(np.linspace(0.2, 0.7, len(df_pie.index)))
ax1.pie(df_pie['Total_sales_used+new'],labels = df_pie.index,colors = colors, autopct='%1.2f%%')
ax1.set_title('11.сумарного обсягу продаж за кожен рік')


#12. Побудувати на одному графіку:
#a. Сумарний дохід від продажу нових авто;
#b. Сумарний дохід від продажу старих авто.
print('#12. Побудувати на одному графіку:a. Сумарний дохід від продажу нових авто; b. Сумарний дохід від продажу старих авто.')
df_last = df[['Total_Sales_New','Total_Sales_Used']].sum()
fig2, ax2 = plt.subplots()
ax2.bar(df_last.index,df_last)
ax2.set_ylabel('Counts in 10^11')
ax2.set_title('12.Сумарний дохід від продажу старих\нових авто')


plt.show()